In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
myDic = {"Hüsna" : 22, "Ali" : 24, "Ayşe" : 34}

In [3]:
pd.Series(myDic)

Hüsna    22
Ali      24
Ayşe     34
dtype: int64

In [4]:
ages = [22, 24, 34]
names = ["Hüsna", "Ali", "Ayşe"]

In [5]:
pd.Series(ages)

0    22
1    24
2    34
dtype: int64

In [6]:
pd.Series(names)

0    Hüsna
1      Ali
2     Ayşe
dtype: object

In [7]:
pd.Series(ages, names)

Hüsna    22
Ali      24
Ayşe     34
dtype: int64

In [8]:
pd.Series(data = ages, index = names)

Hüsna    22
Ali      24
Ayşe     34
dtype: int64

In [9]:
npArray = np.array([22, 24, 34])

In [10]:
npArray

array([22, 24, 34])

In [11]:
pd.Series(npArray)

0    22
1    24
2    34
dtype: int32

In [12]:
pd.Series(npArray, names)

Hüsna    22
Ali      24
Ayşe     34
dtype: int32

In [13]:
data1 = pd.Series([22, 24, 34], ["Hüsna", "Ali", "Ayşe"])

In [14]:
data1

Hüsna    22
Ali      24
Ayşe     34
dtype: int64

In [15]:
data2 = pd.Series([34, 25, 44], ["Hüsna", "Ali", "Ayşe"])

In [16]:
data2

Hüsna    34
Ali      25
Ayşe     44
dtype: int64

In [17]:
data2["Hüsna"]

34

In [18]:
data1["Hüsna"]

22

In [19]:
result = data1 + data2

In [20]:
result

Hüsna    56
Ali      49
Ayşe     78
dtype: int64

In [21]:
newdata1 = pd.Series([39, 23, 45, 24], ["a", "b", "c", "d"])
newdata2 = pd.Series([24, 53, 22, 4], ["a", "c", "f", "e"])

In [22]:
newResult = newdata1 + newdata2   # nan + value = nan

In [23]:
newResult

a    63.0
b     NaN
c    98.0
d     NaN
e     NaN
f     NaN
dtype: float64

# Dataframe Pandas

In [24]:
data = np.random.randn(4, 3)

In [25]:
data

array([[ 0.20954324,  1.81511236, -1.87659199],
       [-1.12327522,  0.27167452,  0.36799957],
       [ 0.75919142, -0.33058852,  0.57955639],
       [ 0.59030594,  0.76719247, -1.65729888]])

In [26]:
dataFrame = pd.DataFrame(data)

In [27]:
dataFrame

          0         1         2
0  0.209543  1.815112 -1.876592
1 -1.123275  0.271675  0.368000
2  0.759191 -0.330589  0.579556
3  0.590306  0.767192 -1.657299

In [28]:
dataFrame[0]

0    0.209543
1   -1.123275
2    0.759191
3    0.590306
Name: 0, dtype: float64

In [29]:
type(dataFrame[0])

pandas.core.series.Series

In [30]:
newDataFrame = pd.DataFrame(data, index =  ["Hüsna", "Ali", "Ayşe", "Mehmet"], columns = ["salary", "age", "hour"] )

In [31]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

In [32]:
newDataFrame["age"]

Hüsna     1.815112
Ali       0.271675
Ayşe     -0.330589
Mehmet    0.767192
Name: age, dtype: float64

In [33]:
newDataFrame["hour"]

Hüsna    -1.876592
Ali       0.368000
Ayşe      0.579556
Mehmet   -1.657299
Name: hour, dtype: float64

In [34]:
newDataFrame[["hour", "salary"]]

            hour    salary
Hüsna  -1.876592  0.209543
Ali     0.368000 -1.123275
Ayşe    0.579556  0.759191
Mehmet -1.657299  0.590306

In [35]:
newDataFrame.loc["Hüsna"]

salary    0.209543
age       1.815112
hour     -1.876592
Name: Hüsna, dtype: float64

In [36]:
newDataFrame.iloc[0]

salary    0.209543
age       1.815112
hour     -1.876592
Name: Hüsna, dtype: float64

In [37]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

## Insert Column

In [38]:
newDataFrame["ID"] = newDataFrame["age"] + newDataFrame["salary"]

In [39]:
newDataFrame

          salary       age      hour        ID
Hüsna   0.209543  1.815112 -1.876592  2.024656
Ali    -1.123275  0.271675  0.368000 -0.851601
Ayşe    0.759191 -0.330589  0.579556  0.428603
Mehmet  0.590306  0.767192 -1.657299  1.357498

## Delete Column

In [40]:
newDataFrame.drop("ID", axis = 1)

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

In [41]:
newDataFrame.drop("Hüsna", axis = 0)

          salary       age      hour        ID
Ali    -1.123275  0.271675  0.368000 -0.851601
Ayşe    0.759191 -0.330589  0.579556  0.428603
Mehmet  0.590306  0.767192 -1.657299  1.357498

In [42]:
newDataFrame

          salary       age      hour        ID
Hüsna   0.209543  1.815112 -1.876592  2.024656
Ali    -1.123275  0.271675  0.368000 -0.851601
Ayşe    0.759191 -0.330589  0.579556  0.428603
Mehmet  0.590306  0.767192 -1.657299  1.357498

### inplace

In [43]:
newDataFrame.drop("ID", axis = 1, inplace = True)

In [44]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

In [45]:
newDataFrame.loc["Hüsna"]

salary    0.209543
age       1.815112
hour     -1.876592
Name: Hüsna, dtype: float64

In [46]:
newDataFrame.loc["Hüsna"]["age"]

1.8151123584659028

In [47]:
newDataFrame.loc["Hüsna", "age"]

1.8151123584659028

In [48]:
booleanFrame = newDataFrame < 0

In [49]:
booleanFrame

        salary    age   hour
Hüsna    False  False   True
Ali       True  False  False
Ayşe     False   True  False
Mehmet   False  False   True

In [50]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

In [51]:
newDataFrame[booleanFrame]  #retun true value

          salary       age      hour
Hüsna        NaN       NaN -1.876592
Ali    -1.123275       NaN       NaN
Ayşe         NaN -0.330589       NaN
Mehmet       NaN       NaN -1.657299

In [52]:
newDataFrame[newDataFrame < 0]

          salary       age      hour
Hüsna        NaN       NaN -1.876592
Ali    -1.123275       NaN       NaN
Ayşe         NaN -0.330589       NaN
Mehmet       NaN       NaN -1.657299

In [53]:
newDataFrame["age"] < 0

Hüsna     False
Ali       False
Ayşe       True
Mehmet    False
Name: age, dtype: bool

In [54]:
newDataFrame[newDataFrame["age"] < 0]

        salary       age      hour
Ayşe  0.759191 -0.330589  0.579556

In [55]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

## reset_index()

In [56]:
newDataFrame.reset_index()

    index    salary       age      hour
0   Hüsna  0.209543  1.815112 -1.876592
1     Ali -1.123275  0.271675  0.368000
2    Ayşe  0.759191 -0.330589  0.579556
3  Mehmet  0.590306  0.767192 -1.657299

In [57]:
newDataFrame

          salary       age      hour
Hüsna   0.209543  1.815112 -1.876592
Ali    -1.123275  0.271675  0.368000
Ayşe    0.759191 -0.330589  0.579556
Mehmet  0.590306  0.767192 -1.657299

In [58]:
newIndexList = ["Hüs", "Al", "Ayş", "Mhmt"]

In [59]:
newDataFrame["new index"] = newIndexList

In [60]:
newDataFrame

          salary       age      hour new index
Hüsna   0.209543  1.815112 -1.876592       Hüs
Ali    -1.123275  0.271675  0.368000        Al
Ayşe    0.759191 -0.330589  0.579556       Ayş
Mehmet  0.590306  0.767192 -1.657299      Mhmt

## set_index()

In [61]:
newDataFrame.set_index("new index")

             salary       age      hour
new index
Hüs        0.209543  1.815112 -1.876592
Al        -1.123275  0.271675  0.368000
Ayş        0.759191 -0.330589  0.579556
Mhmt       0.590306  0.767192 -1.657299

In [62]:
newDataFrame

          salary       age      hour new index
Hüsna   0.209543  1.815112 -1.876592       Hüs
Ali    -1.123275  0.271675  0.368000        Al
Ayşe    0.759191 -0.330589  0.579556       Ayş
Mehmet  0.590306  0.767192 -1.657299      Mhmt

In [63]:
newDataFrame.set_index("new index", inplace = True)

In [64]:
newDataFrame

             salary       age      hour
new index
Hüs        0.209543  1.815112 -1.876592
Al        -1.123275  0.271675  0.368000
Ayş        0.759191 -0.330589  0.579556
Mhmt       0.590306  0.767192 -1.657299

In [65]:
newDataFrame.loc["Mhmt"]

salary    0.590306
age       0.767192
hour     -1.657299
Name: Mhmt, dtype: float64

# Multi Index

In [66]:
firstIndex = ["Simpson", "Simpson", "Simpson", "South Park", "South Park",  "South Park"]

In [67]:
secondIndex = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [68]:
combinedIndex = list(zip(firstIndex, secondIndex))

In [69]:
combinedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [70]:
combinedIndex = pd.MultiIndex.from_tuples(combinedIndex)

In [71]:
combinedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [72]:
myCartoonList = [[40, "A"], [10, "B"], [30, "C"], [9, "D"], [10, "E"], [11, "F"]]

In [73]:
type(myCartoonList)

list

In [74]:
myCartoonArray = np.array(myCartoonList)

In [75]:
type(myCartoonArray)

numpy.ndarray

In [76]:
cartoonDataFrame = pd.DataFrame(myCartoonArray, index = combinedIndex, columns = ["Age", "Job"])

In [77]:
cartoonDataFrame

                   Age Job
Simpson    Homer    40   A
           Bart     10   B
           Marge    30   C
South Park Cartman   9   D
           Kenny    10   E
           Kyle     11   F

In [78]:
cartoonDataFrame.loc["Simpson"]

      Age Job
Homer  40   A
Bart   10   B
Marge  30   C

In [79]:
cartoonDataFrame.loc["South Park"].loc["Kyle"]

Age    11
Job     F
Name: Kyle, dtype: object

In [80]:
cartoonDataFrame.index.names = ["Cartoon Names", "Name"]

In [81]:
cartoonDataFrame

                      Age Job
Cartoon Names Name
Simpson       Homer    40   A
              Bart     10   B
              Marge    30   C
South Park    Cartman   9   D
              Kenny    10   E
              Kyle     11   F

# Operations

In [84]:
dictionary = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,30]}
weatherDataFrame = pd.DataFrame(dictionary)

In [85]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     30

## dropna()

In [86]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [88]:
weatherDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     30

In [97]:
newDictionary = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,30], "Antalya": [45,np.nan,np.nan]}
newDataFrame = pd.DataFrame(newDictionary)

In [98]:
newDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     30      NaN

## thresh

In [99]:
newDataFrame.dropna()

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0

In [100]:
newDataFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     30

In [103]:
#Remove nan values of 2 and above
newDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     30

## fillna()

In [104]:
newDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     30      NaN

In [106]:
#Assign constant values to nan values
newDataFrame.fillna(39)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    39.0     39     39.0
2      39.0    25.0     30     39.0

## groupby

In [110]:
salaryDic = {"Departman" : ["Software", "Sales", "Marketing", "Finance", "IK", "Law"],
            "Employee": ["Ali", "Veli", "Hüsna", "Nur", "Mehmet", "Meryem"],
            "Salary": [1000, 2130, 3245, 3324, 4234, 2242]}

In [111]:
salaryDataFrame = pd.DataFrame(salaryDic)

In [112]:
salaryDataFrame

   Departman Employee  Salary
0   Software      Ali    1000
1      Sales     Veli    2130
2  Marketing    Hüsna    3245
3    Finance      Nur    3324
4         IK   Mehmet    4234
5        Law   Meryem    2242

In [115]:
groupObje = salaryDataFrame.groupby("Departman")

In [116]:
groupObje.count()

           Employee  Salary
Departman
Finance           1       1
IK                1       1
Law               1       1
Marketing         1       1
Sales             1       1
Software          1       1

In [117]:
groupObje.mean()

           Salary
Departman
Finance      3324
IK           4234
Law          2242
Marketing    3245
Sales        2130
Software     1000

In [118]:
groupObje.min()

          Employee  Salary
Departman
Finance        Nur    3324
IK          Mehmet    4234
Law         Meryem    2242
Marketing    Hüsna    3245
Sales         Veli    2130
Software       Ali    1000

In [119]:
groupObje.max()

          Employee  Salary
Departman
Finance        Nur    3324
IK          Mehmet    4234
Law         Meryem    2242
Marketing    Hüsna    3245
Sales         Veli    2130
Software       Ali    1000

In [120]:
groupObje.describe()

          Salary
           count    mean std     min     25%     50%     75%     max
Departman
Finance      1.0  3324.0 NaN  3324.0  3324.0  3324.0  3324.0  3324.0
IK           1.0  4234.0 NaN  4234.0  4234.0  4234.0  4234.0  4234.0
Law          1.0  2242.0 NaN  2242.0  2242.0  2242.0  2242.0  2242.0
Marketing    1.0  3245.0 NaN  3245.0  3245.0  3245.0  3245.0  3245.0
Sales        1.0  2130.0 NaN  2130.0  2130.0  2130.0  2130.0  2130.0
Software     1.0  1000.0 NaN  1000.0  1000.0  1000.0  1000.0  1000.0

# Concatenation

In [124]:
dic1 = {"Name" : ["Selma", "Ali", "Mehmet", "Fatma"], "Sport": ["Run", "Swim", "Run", "Basketball"], "Calorie" : [100,2000,3000,400]}

In [125]:
dataFrame1 = pd.DataFrame(dic1, index = [0,1,2,3])

In [126]:
dataFrame1

     Name       Sport  Calorie
0   Selma         Run      100
1     Ali        Swim     2000
2  Mehmet         Run     3000
3   Fatma  Basketball      400

In [127]:
dic2 = {"Name" : ["Osman", "Alime", "Levent", "Fatih"], "Sport": ["Run", "Swim", "Run", "Basketball"], "Calorie" : [100,2000,3000,400]}

In [130]:
dataFrame2 = pd.DataFrame(dic2, index = [4,5,6,7])

In [131]:
dataFrame2

     Name       Sport  Calorie
4   Osman         Run      100
5   Alime        Swim     2000
6  Levent         Run     3000
7   Fatih  Basketball      400

## concat()

In [133]:
pd.concat([dataFrame1, dataFrame2], axis = 0 )

     Name       Sport  Calorie
0   Selma         Run      100
1     Ali        Swim     2000
2  Mehmet         Run     3000
3   Fatma  Basketball      400
4   Osman         Run      100
5   Alime        Swim     2000
6  Levent         Run     3000
7   Fatih  Basketball      400

# Merge

In [139]:
mergeDic1 = {"Name" : ["Selma", "Ali", "Mehmet", "Fatma"], "Sport": ["Run", "Swim", "Run", "Basketball"]}
mergeDataFrame1 = pd.DataFrame(mergeDic1)

In [140]:
mergeDataFrame1

     Name       Sport
0   Selma         Run
1     Ali        Swim
2  Mehmet         Run
3   Fatma  Basketball

In [141]:
mergeDic2 = {"Name" : ["Selma", "Ali", "Mehmet", "Fatma"], "Calorie" : [100,2000,3000,400]}
mergeDataFrame2 = pd.DataFrame(mergeDic2)

In [142]:
mergeDataFrame2

     Name  Calorie
0   Selma      100
1     Ali     2000
2  Mehmet     3000
3   Fatma      400

## merge()

In [144]:
# on = "common column"
pd.merge(mergeDataFrame1, mergeDataFrame2, on = "Name")

     Name       Sport  Calorie
0   Selma         Run      100
1     Ali        Swim     2000
2  Mehmet         Run     3000
3   Fatma  Basketball      400

In [149]:
salaryDic =  {"Employee": ["Ali", "Veli", "Hüsna", "Nur", "Mehmet", "Meryem"],
           "Departman" : ["Software", "Sales", "Marketing", "Finance", "Software", "Law"],
           "Salary": [1000, 2130, 3245, 3324, 4234, 2242]}

In [150]:
salaryDataFrame = pd.DataFrame(salaryDic)

In [151]:
salaryDataFrame

  Employee  Departman  Salary
0      Ali   Software    1000
1     Veli      Sales    2130
2    Hüsna  Marketing    3245
3      Nur    Finance    3324
4   Mehmet   Software    4234
5   Meryem        Law    2242

In [152]:
salaryDataFrame["Departman"]

0     Software
1        Sales
2    Marketing
3      Finance
4     Software
5          Law
Name: Departman, dtype: object

## unique()

In [154]:
salaryDataFrame["Departman"].unique()

array(['Software', 'Sales', 'Marketing', 'Finance', 'Law'], dtype=object)

## nunique()

In [156]:
# unique counter
salaryDataFrame["Departman"].nunique()

5

## value_counts()

In [159]:
salaryDataFrame["Departman"].value_counts()

Software     2
Law          1
Finance      1
Marketing    1
Sales        1
Name: Departman, dtype: int64

In [160]:
def computeSalary(salary):
    return salary * 0.6

## apply()

In [162]:
salaryDataFrame["Salary"].apply(computeSalary)

0     600.0
1    1278.0
2    1947.0
3    1994.4
4    2540.4
5    1345.2
Name: Salary, dtype: float64

## isnull()

In [163]:
salaryDataFrame.isnull()

   Employee  Departman  Salary
0     False      False   False
1     False      False   False
2     False      False   False
3     False      False   False
4     False      False   False
5     False      False   False

In [169]:
cartoonDic = {"Cartoon Class": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
             "Cartoon Name": ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
             "Cartoon Age": [9,10,30,21, 10]}

cartoonDataFrame = pd.DataFrame(cartoonDic)

In [170]:
cartoonDataFrame

  Cartoon Class Cartoon Name  Cartoon Age
0    South Park      Cartman            9
1    South Park        Kenny           10
2       Simpson        Homer           30
3       Simpson         Bart           21
4       Simpson         Bart           10

## pivot_table()

In [174]:
#default aggfunc = np.mean
cartoonDataFrame.pivot_table(values = "Cartoon Age", index = ["Cartoon Class", "Cartoon Name"])

                            Cartoon Age
Cartoon Class Cartoon Name
Simpson       Bart                 15.5
              Homer                30.0
South Park    Cartman               9.0
              Kenny                10.0

### aggfunc

In [175]:
cartoonDataFrame.pivot_table(values = "Cartoon Age", index = ["Cartoon Class", "Cartoon Name"], aggfunc = np.sum)

                            Cartoon Age
Cartoon Class Cartoon Name
Simpson       Bart                   31
              Homer                  30
South Park    Cartman                 9
              Kenny                  10